import 'package:flutter/material.dart';

class DetailsPage extends StatefulWidget {
  final String alias;
  const DetailsPage({required this.alias, Key? key}) : super(key: key);

  @override
  State<DetailsPage> createState() => _DetailsPageState();
}

class _DetailsPageState extends State<DetailsPage> {
  final Map pages = {
    'policy': const InfoPolicy(),
    'community': const InfoCommunity(),
    'rules': const InfoRules()
  };

  final Map title = {
    'policy': 'ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ',
    'community': 'ПРАВИЛА СПІЛЬНОТИ',
    'rules': 'ПРАВИЛА КОРИСТУВАННЯ'
  };

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(title[widget.alias]),
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(10),
          child: Column(
            children: [
              pages[widget.alias]
            ],
          ),
        )
      )
    );
  }
}


class InfoPolicy extends StatefulWidget {
  const InfoPolicy({Key? key}) : super(key: key);

  @override
  State<InfoPolicy> createState() => _InfoPolicyState();
}

class _InfoPolicyState extends State<InfoPolicy> {
  @override
  Widget build(BuildContext context) {
    String text = "1. Основні визначення \n\n"

        "AppStore, Google PlayMarket– офіційні інтернет-ресурси корпорацій Apple, Googleвідповідно, призначені для розміщення мобільних додатків в загальний доступ. "

        "Мобільний додаток – Casual News -  додаток, встановлений з Apple AppStoreабо GooglePlayMarketна смартфоні клієнта, розроблений і розміщений від \"Casual News\" "

        "Персональні дані – дані клієнтів – фізичних осіб, необхідні для надання \"Casual News\" послуг з пошуку брендових речей.\n\n"

        "2. Загальні положення\n\n"

        "Дана політика конфіденційності описує яким чином можуть використовуватися, зберігатися і оброблятися персональні дані при використанні клієнтами мобільних додатків \"Casual News\" "

        "Персональні дані клієнта \"Casual News\" такі як: прізвище, ім’я, по батькові, номер телефону, передаються \"Casual News\"  за згодою клієнта. "

    "Клієнт надає свої персональні дані шляхом їх введення у відповідні поля в формах мобільного додатку."

    "Надаючи свою персональну інформацію, або використовуючи мобільний додаток, клієнт погоджується з умовами і положеннями цієї Політики конфіденційності. "

    "Підставою згоди клієнта на передачу персональних даних є встановлення мобільного додатку і виконання будь-якого запиту в додатку. \n\n"

    "3. Передача персональних даних \n\n"

    "Мобільними додатками можуть передаватися персональні дані для надання \"Casual News\" послуг . "

    "Мобільними додатками можуть передаватися персональні дані необхідні для: \n"

    "- створення заявок \n"

    "- виконання запитів клієнта та надання консультацій; \n"

    "- отримання повідомлень від \"Casual News\" \n"

    "За виняткових обставин \"Casual News\" може розкрити персональні дані на вимогу законодавства. \n\n"

    "4. Зберігання та обробка даних \n\n"

    "Персональні дані клієнта зберігаються виключно на електронних носіях \"Casual News\" і використовуватися виключно за призначенням, обумовленим в п.3 цієї Політики конфіденційності. "

    "Персональні дані зберігаються на електронних носіях \"Casual News\" безстроково. \n\n"

    "5. Заходи щодо захисту інформації про клієнтів \n\n"

    "\"Casual News\"  вживає технічні та організаційно-правові заходи задля захисту персональних даних клієнтів від неправомірного або випадкового доступу до них, знищення, зміни, блокування, копіювання, поширення, а також від інших неправомірних дій. "

    "\"Casual News\" не гарантує повного виключення зловживань персональними даними з боку порушників, а також якщо клієнт не зберігав паролі для облікових записів в безпечному місці та розголошував їх третім особам. ";

    return Container(
        child: Column(
          children: [
            const SizedBox(
              child: Text('ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ДЛЯ МОБІЛЬНИХ ДОДАТКІВ', textAlign: TextAlign.justify, style: TextStyle(fontSize: 24),),
            ),
            Padding(padding: EdgeInsets.only(top: 20)),
            Text(text, textAlign: TextAlign.justify, style: TextStyle(fontSize: 20),),
          ],
        )
    );
  }
}


class InfoCommunity extends StatefulWidget {
  const InfoCommunity({Key? key}) : super(key: key);

  @override
  State<InfoCommunity> createState() => _InfoCommunityState();
}

class _InfoCommunityState extends State<InfoCommunity> {
  @override
  Widget build(BuildContext context) {
    String text = 'Використовуючи Casual News, ви стаєте частиною величезної спільноти.  Нижче ви знайдете інформацію про те, яких правил тут слід дотримуватися. '

    'Якщо ви виявите контент, який не відповідає нашим правилам, надішліть його на перевірку .\n'
    'Спам та шахрайство Заборонено спам, шахрайство та інші види обману користувачів. \n'
    'Делікатний контент\n'
    'Ми прагнемо забезпечити безпеку всіх клієнтів, особливо неповнолітніх.  Для цього ми розробили спеціальні правила, з якими ви можете ознайомитись за посиланнями нижче. \n'
    'Відео зі сценами насильства та небезпечний контент\n\n'
    'У Casual News заборонені дискримінаційні висловлювання, експлуататорська поведінка, переслідування та сцени насильства, а також матеріали, що пропагують небезпечні чи незаконні дії. \n'
    'Товари, які підпадають під дію спеціальних законів\n\n'
    'Неправдива інформація \n\n'
    'У Casual News неприпустимий контент з недостовірною або неправдивою інформацією, здатною завдати серйозної шкоди, у тому числі в реальному житті. \n\n'
    'Будь ласка, поставтеся до цих правил з повною відповідальністю';

    return Container(
        child: Column(
          children: [
            const SizedBox(
              child: Text('ПРАВИЛА СПІЛЬНОТИ', textAlign: TextAlign.justify, style: TextStyle(fontSize: 24),),
            ),
            const Padding(padding: EdgeInsets.only(top: 20)),
            Text(text, textAlign: TextAlign.justify, style: TextStyle(fontSize: 20),),
          ],
        )
    );
  }
}

class InfoRules extends StatefulWidget {
  const InfoRules({Key? key}) : super(key: key);

  @override
  State<InfoRules> createState() => _InfoRulesState();
}

class _InfoRulesState extends State<InfoRules> {
  @override
  Widget build(BuildContext context) {
    String text = '1. Загальні положення'
    '1.1. Дані правила (надалі – Правила) регулюють відносини між зареєстрованим'
    'користувачем (далі - Користувач) мобільного додатку TheTable (далі – Мобільний додаток) і'
    'ТОВ «АЙ ТІ ТЕЙБЕЛ» ( надалі – АЙ ТІ ТЕЙБЛ) - адміністратор Мобільного додатку. Дані'
    'правила є публічною офертою АЙ ТІ ТЕЙБЛ, адресованою Користувачам (невизначеному'
    'колу дієздатних повнолітніх фізичних осіб). Дані Правила є обов’язковими для АЙ ТІ ТЕЙБЛ'
    'після розміщення їх тексту у Мобільному додатку TheTable, який доступний для'
    'завантаження за наступними посиланнями: https://play.google.com/store/apps/details?'
    'id=com.itp.rockit.thetable та https://apps.apple.com/ua/app/thetable/id1314408223. Для'
    'Користувача дані Правила стають обов’язковими після Реєстрації у Мобільному додатку'
    'TheTable шляхом створення логіну (номера мобільного телефону Користувача) та паролю'
    '\'(PIN коду).\''
    '1.2. За допомогою Мобільного додатку його Користувач має можливість здійснити'
    'бронювання місць у закладах представлених у каталозі Мобільного додатку на умовах, які'
    'вказуються відповідним Закладом при бронюванні та відповідно до умов публічної оферти,'
    'яка розміщена у Профайлі Користувача.'
    '1.3. При використанні будь-якої з функцій або сервісів Мобільного додатку'
    'Користувач підпорядковується даним Правилам. Правила розміщені у Профайлі (особистому'
    'кабінеті) зареєстрованого Користувача.'
    '1.4. Користувач надає свою згоду на дотримання умов даних Правил під час реєстрації'
    'у Мобільному додатку та при використанні будь-якого сервісу Мобільного додатку. У разі'
    'незгоди Користувача з будь-яким з положень цих Правил, Користувач не може користуватися'
    'Мобільним додатком.'
    '1.5. АЙ ТІ ТЕЙБЛ має право в односторонньому порядку вносити змінити, поправки,'
    'доповнювати або будь-яким іншим чином змінювати текст даних Правил без попереднього'
    'повідомлення Користувача. Користувач зобов’язується слідкувати за змінами даних Правил у'
    'особистому Профайлі. Зміни і доповнення до даних Правил набувають чинності з дати їх'
    'публікації у Мобільному додатку. З такої дати, Користувач вважається ознайомленим з'
    'умовами даних Правил. Користувач, який не скасував реєстрацію у Мобільному додатку,'
    'визнається таким, що прийняв відповідні зміни та погодився з ними. Відстеження змін даних'
    'Правил здійснюється Користувачем самостійно, при виникненні розбіжностей або спорів,'
    'Користувач не може посилатися на те, що він не знав або не міг знати про внесення змін до'
    'даних Правил.'
    '1.6. При Бронюванні через Мобільний додаток Користувач вступає в договірні'
    'відносини із суб’єктом господарювання, який надає послуги у обраному Користувачем'
    'Закладі з каталогу Мобільного додатку. Користувач зобов’язується ознайомитися з умовами'
    'такого Договору (у формі публічної оферти) до проведення бронювання. Умови Договору'
    'доступні Користувачу у його Профайлі Мобільного додатку.'
    '1.7. АЙ ТІ ТЕЙБЛ на умовах даної Оферти надає Користувачу послуги в сфері'
    'інформатизації та забезпечує Користувачу можливість доступ до Мобільного додатку та'
    'використання функціоналу такого Мобільного додатку, технічну можливість ознайомитися з'
    'інформацією про заклади й послуги, що надаються ними, про наявність місць у закладах, що'
    'підлягають бронюванню, оформити бронювання місць, здійснити оплату за допомогою'
    'платіжних систем представлених у Мобільному додатку TheTable, відмовитися від'
    'заброньованих місць. Послуги в сфері інформатизації, що надаються АЙ ТІ ТЕЙБЛ'
    'Користувачу, пов’язані з організацією технічної можливості збереження Користувачем'
    'внесеної особистої інформації для здійснення у подальшому замовлень Бронювання з'
    'Депозитом, складає 1 (одну) гривню 00 коп. Вартість послуг за внесення та оновлення такої'
    'інформації (для можливості проведення оплати) у особистому Профайлі оплачується'
    'Користувачем щоразу при внесенні такої інформації або зміні таких відомостей у особистому'
    'Профайлі).'
    '1.8. Користувач отримує право використовувати Мобільний додаток за принципом «як'
    'є» і «при можливості». Це означає, що АЙ ТІ ТЕЙБЛ не гарантує відсутність помилок в'
    'роботі Мобільного додатку; не несе відповідальність за спричинення будь-яких збитків, які'
    'виникли або можуть виникнути в зв\'язку з використанням Мобільного додатку; не несе'
    "відповідальність за невиконання або неналежне виконання своїх зобов'язань внаслідок збоїв"
    'в телекомунікаційних і енергетичних мережах, дій шкідливих програм, а також'
    'недобросовісних дій третіх осіб, спрямованих на несанкціонований доступ та / або'
    'виведення з ладу Мобільного додатку.'
    '1.9. Користувач зобов’язується дотримуватися положень чинного законодавства'
    'України, даних Правил, Договору з Закладом та інших спеціальних документів, які розміщені'
    'у Профайлі Користувача у Мобільному додатку.'
    '1.10. Користувачу забороняється публікувати і передавати іншим способом матеріали,'
    'які завдають або можуть завдати шкоди честі, гідності та діловій репутації громадянина або'
    'діловій репутації будь-якої організації; використовувати нецензурну лексику; матеріали'
    'еротичного та порнографічного характеру чи гіпертекстові посилання на Інтернет-ресурси,'
    'що містять такі матеріали; контент, який пропагує суїцид, містить опис способів суїциду та'
    'будь-які підбурювання до його здійснення; інформацію про наркотичні і психотропні'
    'речовини; матеріал шахрайського характеру; здійснювати несанкціонований доступ до'
    'облікових записів інших Користувачів, в тому числі шляхом підбирання або введення пароля,'
    'а також робити спроби такого доступу; використовувати обліковий запис іншого Користувача'
    'або користуватися банківськими картками, які не належать Користувачу.'
    '1.11. АЙ ТІ ТЕЙБЛ має право на власний розсуд видаляти будь-яку інформацію, яка'
    'порушує і / або може порушувати чинне законодавство України, положення даних Правил,'
    'інших документів АЙ ТІ ТЕЙБЛ або права третіх осіб.'
    '1.12. АЙ ТІ ТЕЙБЛ має право в будь-який момент вимагати від Користувача'
    'підтвердження даних, зазначених при реєстрації, і запросити у зв’язку з цим підтверджуючі'
    'документи. Ненадання таких документів, на розсуд АЙ ТІ ТЕЙБЛ, може бути прирівняне до'
    'надання недостовірної інформації.'
    '1.13. Вся розміщена Користувачами у Мобільному додатку інформація вважається'
    'власністю Користувачів, які її розмістили, до тих пір, поки не буде підстав вважати інакше.'
    'Всю відповідальність за відповідність такої інформації (Контенту) законодавству України'
    'несуть такі Користувачі. Користувачі Мобільного додатку не отримують ніяких прав на'
    'використання інформації, розміщеної іншими Користувачами і несуть повну відповідальність'
    'перед власником інформації за її неправомірне використання.'
    '2. Реєстрація у Мобільному додатку'
    '2.1. Реєстрація в Мобільному додатку здійснюється Користувачем після завантаження'
    'та встановлення Мобільного додатку, шляхом заповнення запропонованої реєстраційної'
    'форми або використання інформації з соціальної мережі. В реєстраційній формі Користувач'
    'має вказати: ім’я та власний мобільний номер телефону, через який буде використовуватись'
    'Мобільний додаток. При заповненні реєстраційної форми Користувачу буде запропоновано'
    'внести інформацію в інші поля реєстраційної форми, які не є обов’язковими та'
    'заповнюються за бажанням Користувача.'
    'За результатами заповнення інформації про платіжну карту Користувача проводиться'
    'верифікація - перевірка дійсності та аутентифікація такої платіжної карти відповідно до'
    'стандартів відповідних платіжних систем. Інформація про платіжну карту Користувача може'
    'бути вказана Користувачем при реєстрації (за бажанням), та при здійсненні оплати Депозиту.'
    'У разі внесення відомостей про платіжну картку, Користувач зобов’язай вказати номер'
    'дійсної власної банківської карти, з якої планує здійснювати оплати у Мобільному додатку'
    'TheTable.'
    'АЙ ТІ ТЕЙБЛ не несе відповідальності за точність та правильність інформації, яка'
    'надається Користувачем при реєстрації, а також введених Користувачем до Мобільного'
    'додатку TheTable даних про банківські картки.'
    'При додаванні банківської картки інформація Користувача перенаправляється на'
    'форму платіжного провайдера. Платіжний провайдер забезпечує можливість здійснення'
    'оплат через платіжні сервіси доступні для використання у Мобільному додатку TheTable та'
    'забезпечує технічну можливість проведення Користувачем подальших "оплат в один клік"'
    'без повторного введення даних банківської карти шляхом прив\'язки такої карти до Профайлу'
    'Користувача і Користувач надає на це свій дозвіл.'
    'Якщо введені Користувачем дані банківської карти дійсні та вірні, банківська картка'
    'успішно додається до Профайлу Користувача.'
    'АЙ ТІ ТЕЙБЛ не збирає, не зберігає, не моніторить дані банківських карток'
    'Користувачів. Дані банківської картки вводяться на захищеній веб-сторінці уповноваженої'
    'платіжної системи.'
    'Мобільний додаток TheTable, встановлений на мобільному пристрої Користувача,'
    'передає всі введені дані банківської картки до платіжної системи з використанням захищених'
    'протоколів зв\'язку.'
    'Проведення оплати у Мобільному додатку Користувачем за допомогою використання'
    'платіжної картки допускається виключно в разі успішної верифікації картки, та в разі'
    'достатнього залишку грошових коштів для проведення оплати замовлених товарів/послуг, та'
    'за наявності технічної можливості опрацювання таких платежів.'
    '2.2. Користувач зобов’язується надати достовірну інформацію, і підтримувати цю'
    'інформацію в актуальному стані, шляхом внесення відповідних змін до своїх даних у'
    'Мобільному додатку. У випадку, якщо Користувач надає недостовірну інформацію або є'
    'підстави вважати, що надана ним інформація неправдива, неправильна, неповна або неточна,'
    'АЙ ТІ ТЕЙБЛ залишає за собою право у будь-який час призупинити або скасувати'
    'реєстрацію Користувача, або відмовити йому у використанні Мобільного додатку.'
    '2.3. По завершенні процесу реєстрації в Мобільному додатку, Користувач отримує'
    'зазначений ним самим логін (номер мобільного телефону Користувача) і PIN для доступу до'
    'особистого Профайлу Мобільного додатку. Доступ до використання Мобільного додатка'
    'надається Користувачу миттєво після завершення реєстрації в Мобільному додатку.'
    'Реєстрація в Мобільному додатку вважається завершеною після введення у Мобільному'
    'додатку Користувачем коду з СМС-повідомлення, яке було надіслане на номер телефону'
    'Користувача, вказаному у якості логіну.'
    '2.4. Користувач самостійно несе відповідальність за безпеку свого логіна і PIN кода, а'
    'також за все, що буде зроблено в Мобільному додатку під логіном і PIN кодом Користувача.'
    'Користувач зобов’язаний негайно повідомити АЙ ТІ ТЕЙБЛ про кожний випадок'
    'незаконного, неавторизованого доступу в Мобільний додаток та/або інші незаконні дії, в тому'
    'числі щодо перерахування грошових коштів в Мобільному додатку, та/або інформацію про'
    'можливість таких дій.'
    '2.5. Користувач повністю приймає умову про те, що він несе повну відповідальність за'
    'всю інформацію, дані, текст, фотоматеріали публічно опубліковані або частково передані за'
    'допомогою Мобільного додатку.'
    '2.6. Користувач має право припинити використання Мобільного додатку і відмовитися'
    'від створеного ним облікового запису (Профайлу), відправивши відповідний запит АЙ ТІ'
    'ТЕЙБЛ.'
    '3. Персональні дані Користувача'
    '3.1. Погоджуючись на реєстрацію та використання Мобільного додатку, Користувач'
    'надає свою згоду АЙ ТІ ТЕЙБЛ на обробку своїх персональних даних, наданих при'
    'здійсненні будь-яких дій в Мобільному додатку, зокрема:'
    '3.1.1. прізвище, ім\'я;'
    '3.1.2. адреса електронної пошти;'
    '3.1.3. локація/ стать/дата народження;'
    '3.1.4. номер мобільного телефону;'
    '3.1.5. фото профілю Користувача;'
    '3.1.6. інша інформація, що надається Користувачем для АЙ ТІ ТЕЙБЛ та підпадає під'
    'визначення персональних даних.'
    '3.2. Обробка персональних даних означає запис, систематизацію, накопичення,'
    'зберігання, уточнення (оновлення, зміна), використання, передачу (поширення, надання,'
    'доступ), в тому числі транскордонну, знеособлення, блокування, видалення, знищення'
    'персональних даних, які не підпадають під спеціальні категорії, на обробку яких потрібна'
    'письмова згода Користувача.'
    '3.3. Обробка персональних даних здійснюється з метою забезпечення Користувача'
    'належним функціонуванням Мобільного додатку, технічною підтримкою, розгляду звернень'
    'та претензій, направлення на адресу електронної пошти і на вказаний номер телефону'
    'Користувача повідомлень інформаційного та рекламного характеру та забезпечення'
    'виконання своїх зобов’язань АЙ ТІ ТЕЙБЛ перед Користувачем. Обробка персональних'
    'даних Користувача здійснюється з метою забезпечення виконання зобов’язань АЙ ТІ ТЕЙБЛ'
    'перед Користувачем.'
    '3.4. Користувач може в будь-який час відкликати згоду на обробку персональних'
    'даних, а також видалити або змінити свої персональні дані, направивши АЙ ТІ ТЕЙБЛ'
    'відповідне повідомлення. При цьому Користувач розуміє, що АЙ ТІ ТЕЙБЛ має право'
    'продовжити використання такої інформації в допустимих чинним законодавством випадках.'
    '3.5. АЙ ТІ ТЕЙБЛ використовує файли cookies для цілей полегшення користування'
    'Мобільним додатком, аналізу і статистики дій Користувача в межах Мобільного додатку.'
    'Файли cookies будуть зберігатися на мобільному телефоні/планшеті Користувача'
    'автоматично, якщо Користувач не заборонить цього, скориставшись налаштуваннями свого'
    'браузера.'
    'АЙ ТІ ТЕЙБЛ та/або треті особи, що технічно обслуговують Мобільний додаток,'
    'можуть збирати IP-адреси з метою системного адміністрування та аудиту використання'
    'Мобільного додатку. АЙ ТІ ТЕЙБЛ може використовувати IP-адресу для ідентифікації'
    'Користувачів Мобільного додатку у випадку, коли це необхідно для захисту процесу надання'
    'послуг, самого Мобільного додатку або інших Користувачів.'
    'Здійснюючи використання Мобільного додатку, Користувач надає АЙ ТІ ТЕЙБЛ та/'
    'або третім особам, що технічно обслуговують Мобільний додаток, свою згоду на збирання та'
    'використання IP-адреси з вказаною вище метою.'
    '3.6. Користувач дає згоду на отримання рекламних матеріалів від АЙ ТІ ТЕЙБЛ або'
    'від Закладу на адресу електронної пошти та контактний телефон, зазначені Користувачем в'
    'власному Профайлі Мобільного додатку.'
    '3.7. АЙ ТІ ТЕЙБЛ має право надавати доступ до інформації про Користувача третім'
    'особам, включаючи транскордонну передачу, якщо така передача необхідна для виконання'
    'АЙ ТІ ТЕЙБЛ зобов\'язань перед Користувачем або для здійснення рекламних або'
    'інформаційних розсилок. АЙ ТІ ТЕЙБЛ має право надавати доступ до інформації про'
    'Користувача третім особам з якими АЙ ТІ ТЕЙБЛ перебуває в договірних відносинах або'
    'може в них увійти в майбутньому, за умови дотримання такими третіми особами'
    'конфіденційності та безпеки персональних даних.'
    '3.8. Обробка персональних даних Користувача здійснюється з використанням баз'
    'даних, що знаходяться на території України.'
    '3.9. АЙ ТІ ТЕЙБЛ зобов’язується приймати необхідні і достатні правові, організаційні'
    'та технічні заходи для захисту інформації, що надається Користувачем, від неправомірного'
    'або випадкового доступу, знищення, перекручення, блокування, копіювання, поширення, а'
    'також від інших неправомірних дій з нею третіх осіб, шляхом обмеження доступу до такої'
    'інформації інших користувачів, співробітників і партнерів АЙ ТІ ТЕЙБЛ та третіх осіб (за'
    'винятком надання АЙ ТІ ТЕЙБЛ інформації, необхідної для виконання своїх зобов\'язань'
    'перед Користувачем, третіми особами та дотримання вимог чинного законодавства), а також'
    'застосування до таких осіб заходів відповідальності за несанкціонований доступ до таких'
    'даних.'
    '3.10. АЙ ТІ ТЕЙБЛ має право проводити статистичні та інші дослідження на основі'
    'знеособленої інформації, наданої Користувачем. АЙ ТІ ТЕЙБЛ має право надавати доступ до'
    'таких досліджень третім особам.'
    '3.11. У разі відкликання Користувачем згоди на обробку персональних даних, АЙ ТІ'
    'ТЕЙБЛ має право обмежити доступ Користувача до деяких або всіх функцій Мобільного'
    'додатку.'
    '3.12. Мобільний додаток може містити посилання на веб-сайти, створені третіми'
    'сторонами, політика щодо захисту персональних даних та інформації яких відрізняється від'
    'політики АЙ ТІ ТЕЙБЛ щодо захисту конфіденційності, яка застосовується такими третіми'
    'сторонами. Рекомендуємо ознайомитися з положенням про конфіденційність усіх сайтів'
    'третіх сторін, перш ніж використовувати такі сайти або надавати свої персональні дані чи'
    'будь-яку іншу інформацію таким сайтам або через них. АЙ ТІ ТЕЙБЛ не несе'
    'відповідальності за веб-сайти третіх осіб та інформацію розміщену на таких веб-сайтах.'
    '3.13. Користувач надає згоду на обробку своїх персональних даних на весь строк'
    'користування Мобільним додатком, але не менше ніж строком на 5 років з дати проведення'
    'реєстрації Користувача у Мобільному додатку.'
    '4. Відповідальність'
    '4.1. З моменту здійснення Користувачем Бронювання АЙ ТІ ТЕЙБЛ діє виключно як'
    'посередник (агент) між Користувачем і суб’єктом господарювання який здійснює свою'
    'діяльність обраному для бронювання Закладі. АЙ ТІ ТЕЙБЛ забезпечує передачу інформації'
    'про Користувача та здійснене ним бронювання відповідному виконавцю та адміністратору'
    'його Закладу.'
    '4.2. Розміщена у Мобільному додатку інформація про істотні умови бронювання (в'
    'тому числі про кількість вільних і зайнятих місць, місцезнаходження Закладу та обраного для'
    'бронювання місця, контакти Закладу, особливості надаваних Закладом послуг з'
    'обслуговування (громадського харчування), вказується відповідним суб’єктом'
    'господарюванням, який здійснює діяльність у обраному Користувачем Закладі. За'
    'достовірність та актуальність вказаної у даному пункті Правил інформації, несе відповідний'
    'суб’єкт господарювання відповідного Закладу.'
    '4.3. Відповідальність за неналежне надання послуг і не надання послуг у Закладі, де'
    'було здійснене бронювання місця Користувачем, несе сам Заклад (відповідний суб’єкт'
    'господарювання який надає послуги Користувачу). АЙ ТІ ТЕЙБЛ за якість наданих послуг'
    'Закладом відповідальності не несе.'
    '4.4. У разі виникнення спорів, Заклад приймає претензії від Користувача.'
    '4.5. Один Користувач може зареєструватися у Мобільному додатку тільки один раз.'
    'Множинна реєстрація заборонена.'
    '4.6. Адміністрація сайту має право припинити дію Профайла зареєстрованого'
    'Користувача (дію реєстрації), а також в односторонньому порядку відмовитися від виконання'
    'цієї Оферти без відшкодування будь-яких збитків, у разі порушення Користувачем умов'
    'даних Правил, а також у разі наявності підозр у АЙ ТІ ТЕЙБЛ в тому, що Користувачем'
    'здійснена множинна реєстрація у Мобільному додатку.'
    '4.7. АЙ ТІ ТЕЙБЛ має право призупинити або скасувати реєстрацію Користувача та'
    'відмовити Користувачу у використанні Мобільного додатку (або їх частин) та відмовитися'
    'від виконання даних Правил в односторонньому порядку без відшкодування будь-яких'
    'збитків, у разі:'
    '- якщо Користувач надає недостовірну інформацію або в АЙ ТІ ТЕЙБЛ є підстави'
    'вважати, що надана Користувачем інформація не відповідає дійсності, вводить в оману;'
    '- якщо дії Користувача суперечать положенням даних Правил;'
    '- якщо АЙ ТІ ТЕЙБЛ запідозрить Користувача у скоєнні протиправних дій, у тому'
    'числі: шахрайство з банківськими картами, поширення спаму, шкідливих програм, інших'
    'діянь, що порушують умови даних Правил.'
    '4.8. АЙ ТІ ТЕЙБЛ не несе відповідальності за дії банку та платіжних систем, або'
    'інших учасників технічного процесу проведення розрахунків, за працездатність та'
    'забезпечення збереження та безпеки інформації, що передається при оформленні бронювання'
    'з оплатою депозиту та проведенні платежів за допомогою банківських платіжних карток'
    'Користувача.'
    '4.9. АЙ ТІ ТЕЙБЛ немає технічної можливості встановлення особи, яка фактично'
    'користується Мобільним додатком TheTable, використовуючи обліковий запис Користувача.'
    'Користувачі зобов\'язані інформувати АЙ ТІ ТЕЙБЛ у випадку, якщо вони мають докази того,'
    'що платіжна картка, зазначена в їх Профайлі в Мобільному додатку TheTable, була вкрадена'
    'та/або використана в шахрайський спосіб третьою стороною. АЙ ТІ ТЕЙБЛ вживатимуть'
    'відповідних заходів безпеки після отримання такого повідомлення від Користувача. Якщо'
    'Користувач не повідомить АЙ ТІ ТЕЙБЛ про крадіжку або втрату картки, АЙ ТІ ТЕЙБЛ не'
    'несе відповідальності за будь-яке шахрайське або інше неправомірне використання такої'
    'картки третіми особами, в тому числі шляхом використання Профайлу Користувача.'
    '5. Інші умови'
    '5.1. Користувач, шляхом реєстрації у Мобільному додатку, підтверджує, що він вільно'
    'володіє українською мовою та заявляє, що договори (оферти) укладені (прийняті)'
    'Користувачем у Мобільному додатку не можуть бути визнані недійсними або не прийнятими'
    'Користувачем на тій лише підставі, що вони складені українською мовою.'
    '5.2. Всі можливі суперечки між Сторонами, що виникли в зв\'язку з цією Угодою,'
    'вирішуються шляхом переговорів. У разі неможливості вирішити суперечку шляхом'
    'переговорів він підлягає розгляду судом за місцезнаходженням АЙ ТІ ТЕЙБЛ.'
    '5.3. Будь-які питання, коментарі та інша кореспонденція Користувача повинні'
    'направлятися АЙ ТІ ТЕЙБЛ електронною поштою на адресу info@thetable.app. АЙ ТІ'
    'ТЕЙБЛ не несе відповідальності і не гарантує відповідь на запити, питання, пропозиції та'
    'іншу інформацію, крім випадків, передбачених чинним законодавством.'
    '5.4. До відносин сторін застосовується законодавство України, спори вирішуються за'
    'законодавством України.'
    '5.5. Електронне листування сторін та їх представників має силу доказів при'
    'досудовому та судовому вирішенні спору.'
    '5.6. У разі виникнення протиріч, текст даних Правил, розміщений у Мобільному'
    'додатку, матиме перевагу в порівнянні з будь-яким іншим текстом Правил.'
    'Текст даних правил опублікований у Мобільному додатку TheTable 5 липня 2020 р.'
    'Адміністратор:'
    'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ "АЙ ТІ ТЕЙБЛ"'
    'ідентифікаційний код юридичної особи 43578797'
    'зареєстроване за адресою: 03056, м. Київ, вул. Польова, 23Б'
    'електронна адреса: info@ thetable.app'
    'тел. +380951500402 (тарифікація дзвінків здійснюється згідно умов мобільного'
    'оператора Користувача)'
    'ПУБЛІЧНА ОФЕРТА'
    'про надання послуг з обслуговування в закладах громадського харчування'
    'На умовах даної публічної оферти «Виконавець» - суб’єкт господарювання, який здійснює'
    'свою діяльність в сфері організації громадського харчування (бар, ресторан, кафе, інший заклад, далі'
    '- «Заклад») з каталогу, опублікованого у Мобільному додатку TheTable, зобов\'язується надати послуги'
    'з обслуговування в Закладі Виконавця відповідно до цін, встановлених у меню Закладу Виконавця на'
    'дату відвідування Закладу будь-якій дієздатній повнолітній фізичній особі, що діє від свого імені (далі'
    'по тексту - «Користувач» ), відповідно до зазначених в цьому документі умовах.'
    'Користувач після акцепту цієї Оферти стає стороною даного Договору надання послуг з'
    'обслуговування в Закладі Виконавця. Виконавець і Користувач спільно іменуються «Сторони», кожен'
    'окремо - «Сторона».'
    'Терміни у даній оферті означають наступне:'
    'Оферта - офіційна пропозиція Виконавця укласти Договір з Користувачем на зазначених у'
    'цьому документі умовах.'
    'Бронювання - замовлення певного столика/шезлонга/кімнати/бесідки (надалі за текстом –'
    'столика) Користувачем у Закладі Виконавця на певну дату і час. Бронювання здійснюється за'
    'допомогою використання Мобільного додатку TheTable. Бронювання вважається вчиненим з моменту'
    'здійснення Користувачем оплати Депозиту в розмірі, зазначеному Виконавцем в умовах при'
    'оформленні Бронювання, або, якщо Депозит щодо типу обраного Бронювання не встановлений'
    'Виконавцем або дорівнює нулю - з моменту завершення процедури Бронювання у Мобільному'
    'додатку і отримання підтвердження про успішне завершення Бронювання. Бронювання може бути'
    'здійснене виключно зареєстрованим користувачем Мобільного Додатку TheTable, який авторизований'
    'у Мобільному додатку. Умови здійсненого Користувачем Бронювання та'
    'статус (скасоване/виконане/заплановане) відображаються у особистому Профайлі Користувача та'
    'Виконавця.'
    'Відвідувач - фізична особа, яка безпосередньо отримує обслуговування в Закладі Виконавця'
    '(Користувач і / або Клієнт і /або Неповнолітній клієнт).'
    'Договір - договір між Виконавцем і Користувачем про надання Послуг з обслуговування в'
    'Закладі Виконавця на умовах цієї Оферти, який укладається шляхом акцепту цієї угоди. Договір між'
    'Сторонами визнається укладеним у момент отримання Агентом в інтересах Виконавця Акцепту'
    'Оферти від Користувача шляхом здійснення підтвердження ним обраного Бронювання.'
    'Депозит – мінімальна грошова сума, яка сплачується Користувачем як сума попередньої'
    'оплати замовлених у Виконавця Послуг з обслуговування згідно умов обраного Користувачем'
    'Бронювання. Перелік Послуг з обслуговування, які оплачені Користувачем шляхом внесення суми'
    'Депозиту, вказується Виконавцем в умовах обраного Користувачем Бронювання. Сума Депозиту за'
    'один столик є фіксованою та визначається і вказується в умовах Бронювання Виконавцем. Депозит,'
    'встановлений для одного і того ж столика, може бути різним у залежності від дати і часу доби, на які'
    'здійснюється Бронювання даного Столика. Сума Депозиту щодо конкретного столика на конкретний'
    'час може дорівнювати нулю.'
    'Заклад – заклад громадського харчування, в якому Виконавець здійснює свою господарську'
    'діяльність.'
    'Користувач – фізична особа, зареєстрований та авторизований користувач Мобільного'
    'додатку TheTable, який здійснює Бронювання у Закладі Виконавця.'
    'Послуги з обслуговування - послуги з обслуговування в Закладі Виконавця, що включають в'
    'себе Бронювання і безпосереднє обслуговування (послуги громадського харчування та проведення'
    'дозвілля) в Закладі Виконавця відповідно до умов здійсненого Бронювання. Замовлення Послуг на'
    'обслуговування вважається вчиненим з моменту завершення Бронювання.'
    'PIN Профайлу – пароль для входу до особистого Профайлу Користувача, унікальна'
    'комбінація чотирьох цифр, що створюється та встановлюється Користувачем при проведені'
    'реєстрації. Цю комбінацію Користувач самостійно зазначає в спеціальному полі «PIN» при вході до'
    'особистого Профайлу у Мобільному додатку TheTable. Користувач особисто несе відповідальність за'
    'схоронність такого паролю особистого Профайлу.'
    'Логін Профайлу – номер мобільного телефону, що вказується Користувачем при реєстрації у'
    'Мобільному додатку TheTable. Користувач особисто несе відповідальність за схоронність Логіну'
    'особистого Профайлу.'
    'Меню Закладу - перелік страв і напоїв, які пропонуються для замовлення Відвідувачам/'
    'Користувачу в Закладі Виконавця із зазначенням їх вартості. В меню Закладу на умовах даного'
    'Договору не входять підакцизні товари (алкогольні напої та тютюнові вироби).'
    'Мобільний додаток – мобільний застосунок, оригінальне програмне забезпечення, а саме'
    'Мобільний додаток під назвою TheTable, розташований та доступний для завантаження та'
    'встановлення на мобільні телефонні пристрої/планшети всіма бажаючими користувачами мережі'
    'Інтернет, з наступних ресурсів: Apple Store, Google Play. Користувач може користуватися Мобільним'
    'додатком через власний Профайл після проведення реєстрації або авторизації зареєстрованого'
    'користувача Мобільного додатку за умови наявності доступу до мережі Інтернет. Мобільний додаток'
    'TheTable доступний для завантаження за наступними посиланнями: https://play.google.com/store/apps/'
    'details?id=com.itp.rockit.thetable та https://apps.apple.com/ua/app/thetable/id1314408223.'
    'Мобільний додаток TheTable забезпечує можливість Користувачу у будь-який час:'
    '- отримати актуальну інформацію про відповідний Заклад, зокрема про планування'
    'відповідного Закладу (розміщення столів/шезлонгів/кімнат/бесідок в Закладі), про статус столів/'
    'шезлонгів/кімнат/бесідок в Закладі (вільний/зарезервований на певну дату та час), про розмір'
    'Депозиту (або його відсутність) у випадку Бронювання відповідного столу/шезлонгу/кімнати/бесідки'
    'на певні дату та час тощо;'
    '- здійснити Бронювання обраного Користувачем столу/шезлонгу/кімнати/бесідки в Закладі'
    'Виконавця у відповідні дату та час;'
    '- у разі необхідності сплати за обраний стіл/шезлонг/кімнату/бесідку відповідної суми'
    'Депозиту, здійснити такий платіж за допомогою платіжних систем, представлених до використання у'
    'Мобільному додатку. При цьому Сторонами погоджено, що Депозит може бути використаний'
    'Користувачем на оплату виключно товарів та/або послуг у відповідному Закладі Виконавця в обрану'
    'дату та час Бронювання.'
    'Акцепт оферти або Акцепт – повне, безумовне та беззастережне прийняття Користувачем'
    'умов даних Правил. Акцепт здійснюється шляхом заповнення реєстраційної форми у Мобільному'
    'додатку та створення облікового запису (Профайлу). Акцептуючи умови публічної оферти цього'
    'Договору, Користувач підтверджує, що володіє необхідною правоздатністю і повноваженнями для'
    'прийняття умов цього Договору, здатний виконувати його умови та нести відповідальність за'
    'порушення викладених у ньому умов, ознайомився з умовами цього Договору в повному обсязі та'
    'приймає їх у повному обсязі без будь-яких застережень, вилучень чи обмежень, згоден і'
    'зобов’язується дотримуватись умов цього Договору; ознайомився із Правилами користування'
    'Мобільним додатком та даною Офертою, приймає всі їх умови в повному обсязі без будь-яких,'
    'застережень, вилучень чи обмежень та надає згоду на обробку своїх персональних даних, наданих'
    'при реєстрації та при використанні Мобільного додатку. Прийняття оферти здійснюється'
    'Користувачем у відповідності до п 1.2. Оферти.'
    'Агент - ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ "АЙ ТІ ТЕЙБЛ",'
    'ідентифікаційний код юридичної особи 43578797, зареєстроване за адресою: 03056, м. Київ, вул.'
    'Польова, 23Б, що діє в якості уповноваженого комерційного агента Виконавця в розумінні ч. 1 ст. 297'
    'ГК України. Повноваження Агента підтверджуються договором з Виконавцем.'
    'Онлайн-сервіс – хмарний сервер, який працює через Мобільний додаток TheTable.'
    'Профайл – особистий кабінет Користувача, персональна закрита від доступу третіх осіб'
    'частина Мобільного додатку TheTable, що забезпечує можливість обміну даними, інформацією і'
    'повідомленнями між Користувачем, Агентом і Виконавцем, а також можливість фіксації складу'
    'Послуг з обслуговування, здійснених Користувачем. Профайл створюється після реєстрації'
    'Користувача у Мобільному додатку TheTable. Доступ до Профайлу надається Користувачу після'
    'введення логіна доступу і PIN кода. Доступ до Профайлу надається цілодобово, за виключенням'
    'перерв для проведення технічних робіт. У Профайлі Користувача відображається інформація про'
    'здійснені ним Бронювання, проведені оплати Депозитів та інша інформація, згідно діючого'
    'функціоналу Мобільного додатку TheTable.'
    'Реєстрація у Мобільному додатку TheTable - стандартна процедура, за результатами якої'
    'створюється особистий Профайл Користувача. Під час реєстрації в Мобільному додатку Користувач'
    'Мобільного додатку, може здійснити прив’язку банківської картки до систем платежів, що'
    'представлені в Мобільному додатку та використовуються під час здійснення Бронювання з оплатою'
    'Депозиту. Порядок здійснення реєстрації визначається Правилами користування Мобільним додатком'
    'TheTable.'
    '1. ПРЕДМЕТ ДОГОВОРУ ТА ПОРЯДОК ЙОГО УКЛАДЕННЯ'
    '1.1. Виконавець зобов\'язується надавати Користувачу за плату Послуги з обслуговування'
    'відповідно до умов здійсненого Бронювання. Істотні умови Бронювання (сума Депозиту для'
    'запропонованого до Бронюванню столика в залежності від дати і часу Бронювання, Перелік послуг з'
    'обслуговування, які включаються в оплачену Користувачем суму Депозиту, термін для своєчасного'
    'скасування Бронювання, якщо такий термін відмінний від терміну вказаному в п. 5.2. даної Оферти і'
    'т.п.), запропоновані Виконавцем, вказуються у Мобільному додатку TheTable. Бронювання'
    'здійснюється Користувачем в інтерактивному режимі за допомогою Мобільного додатку після'
    'Реєстрації та входу до власного Профайлу Користувача.'
    '1.2. Акцепт цієї Оферти вважається здійсненим Користувачем після завершення Реєстрації в'
    'Мобільному додатку TheTable згідно Правил користування Мобільним додатком TheTable шляхом'
    'використання Одноразового ідентифікатора, який відповідає вимогам п. 3 ч. 1 ст. 12 Закону України'
    '«Про електронну комерцію» та його введенням в спеціальне поле при Реєстрації Користувача у'
    'Мобільному додатку. Реєстрація Користувача може бути здійснення лише після введення'
    'Одноразового ідентифікатора з СМС-повідомлення. Зазначений Одноразовий ідентифікатор'
    'генерується та надсилається Користувачу в СМС-повідомлені. Після зазначених дій даний Договір'
    'між Виконавцем та Користувачем вважається укладеним. Вчинення Користувачем вказаних вище дій і'
    'зміна даних в системі Агента є проставленням електронного підпису в даному Договорі Одноразовим'
    'ідентифікатором відповідно до Закону України «Про електронну комерцію». У разі багаторазових'
    'Бронювань та замовлень Послуг з обслуговування, по кожному Бронюванню укладається окремий'
    'договір на вказаних у даній Оферті умовах та відповідно до додаткових умов здійсненого'
    'Користувачем Бронювання шляхом натиснення Користувачем активної іконки «Забронювати» та'
    'отримання Користувачем підтвердження здійсненого Бронювання. Кожен з Користувачів висловлює'
    'свою згоду з усіма умовами даного Договору та умовами здійсненого Користувачем у подальшому'
    'Бронювання з використанням функцій Мобільного додатку TheTable'
    '1.3. Акцепт даної Оферти означає повну і безумовну згоду Користувача і прийняття усіх умов'
    'цього Договору, умов Бронювання обраного столика у Закладі Виконавця, Політикою'
    'конфіденційності, що розміщені у Профайлі Користувача у Мобільному додатку TheTable. Після'
    'акцепту цієї Оферти, відносини між Виконавцем та Користувачем регулюються положеннями даного'
    'Договору, а в частині, не врегульованій цим Договором – нормами чинного законодавства України.'
    '1.4. Безпосереднє обслуговування Користувача відповідно до умов підтвердженого'
    'Бронювання здійснюється Виконавцем в Закладі Виконавця у відповідну дату та час, які обираються'
    'при проведенні Бронювання Користувачем. Усі істотні умови здійсненого Користувачем Бронювання'
    'відображаються у його Профайлі та у Профайлі Виконавця.'
    '1.5. Сторони дійшли згоди, що у відносинах між Користувачем та Виконавцем в якості'
    'підпису Користувача буде використовуватись електронний підпис одноразовим ідентифікатором,'
    'відповідно до умов даного Договору та Закону України «Про електронну комерцію», що має таку'
    'саму юридичну силу як і власноручний підпис. Усі дії, вчинені в Мобільному додатку зареєстрованим'
    'та авторизованим Користувачем, визнаються вчиненими ним особисто.'
    '2. ПРАВА І ОБОВ’ЯЗКИ ВИКОНАВЦЯ'
    '2.1. Виконавець зобов\'язується:'
    '2.1.1. Надавати Користувачу Послуги з обслуговування відповідно до умов Бронювання, здійсненого'
    'ним (дата, місце і час надання послуг) відповідно до умов цієї Оферти.'
    '2.1.2. Забезпечувати надання Користувачу / Відвідувачу Послуг з обслуговування з дотриманням всіх'
    'вимог чинного законодавства України.'
    '2.1.3. Надати Користувачу достовірну інформацію про Заклад Виконавця при оформленні'
    'Бронювання та істотні умови Бронювання:'
    '- фірмове найменування організації Виконавця і її місце знаходження, інформація про Виконавця;'
    '- адреса Закладу Виконавця, контактний телефон;'
    '- режим роботи Закладу Виконавця;'
    '- істотні умови Бронювання (вартість, час, місце, склад Послуг з обслуговування, що входять до умов'
    'обраного Бронювання, суму Депозиту та інші істотні умови Бронювання).'
    '3. ПРАВА І ОБОВ’ЯЗКИ КОРИСТУВАЧА'
    '3.1. Користувач зобов\'язується:'
    '3.1.1. Оплачувати Виконавцю вартість Послуг з обслуговування в порядку, передбаченому даною'
    'Офертою.'
    '3.1.2. Прибути в Заклад Виконавця у встановлений час та дату або забезпечити прибуття Відвідувачів'
    'та повідомити ідентифікаційні дані Бронювання адміністратору Закладу Виконавця.'
    '3.1.3. У разі неможливості прибути у встановлений час скасувати Бронювання в порядку,'
    'встановленому в розділі 5 даного Договору.'
    '3.1.4. Дотримуватися правил поведінки, що встановлені в Закладі Виконавця для відвідувачів, нести'
    'відповідальність за порушення встановлених правил.'
    '3.1.5. Повністю відшкодувати Виконавцю понесені збитки, якщо Користувач заподіяв шкоду майну'
    'Виконавця. Відшкодування збитків здійснюється згідно прейскуранту Виконавця.'
    '3.2.Користувач має право:'
    '3.2.1. Відмовитися від замовлених Послуг з обслуговування шляхом скасування Бронювання,'
    'попередивши про це Виконавця відповідно до умов статті 5 Оферти.'
    '3.2.2. Звернутися до Виконавця з пропозиціями, скаргами, в тому числі в разі претензій до складу і'
    'якості наданих Послуг з обслуговування.'
    '3.2.3. У будь-який час цілодобово 7 днів на тиждень (за винятком технічних перерв) отримувати за'
    'допомогою Мобільного додатку TheTable інформацію про доступні Бронювання в Закладі Виконавця,'
    'здійснювати Бронювання, отримувати інформацію про замовлені Бронювання, внесену суму'
    'Депозиту.'
    '3.2.4. Вимагати від Виконавця належного надання Послуг з обслуговування.'
    '3.2.5. У разі ненадання Виконавцем Послуг з обслуговування згідно умов оплаченого Користувачем'
    'Бронювання з Депозитом, вимагати від Виконавця повернення повної суми сплаченого Депозиту.'
    '4. ОПЛАТА ПОСЛУГ'
    '4.1. Замовлені Послуги з обслуговування надаються Користувачу згідно меню та цін на'
    'послуги/товари Закладу, які діють у такому Закладі станом на дату обслуговування Користувача в'
    'Закладі Виконавця та згідно цін, визначених у меню обраного Закладу. Ціни зазначені у меню Закладу'
    'в каталозі Мобільного додатку є ознайомчими та можуть не відповідати актуальним цінам станом на'
    'обрану дату відвідування заброньованого Користувачем Закладу. Актуальність цін Користувач'
    'зобов’язаний уточнити перед проведенням Бронювання за контактним телефоном обраного для'
    'Бронювання Закладу.'
    '4.2. При Бронюванні з Депозитом, Користувач сплачує суму Депозиту в розмірі, зазначеному'
    'в умовах Бронювання. Розрахунок за надані Виконавцем Послуги з обслуговування понад сплачену'
    'суму Депозиту проводиться Користувачем безпосередньо в Закладі Виконавця. Не використана'
    'Користувачем сума внесеного Депозиту при Бронюванні поверненню не підлягає та після завершення'
    'строку для своєчасного скасування Бронювання визнається Сторонами завдатком.'
    '4.3. Депозит може бути оплачений Користувачем за допомогою банківської платіжної карти'
    'Visa, MasterCard (далі - «банківська карта»).'
    '4.4. Оплата за допомогою банківської карти може здійснюватися шляхом списання грошових'
    'коштів в розмірі суми Депозиту з банківської карти, введеної Користувачем безпосередньо в момент'
    'оформлення Бронювання з Депозитом.'
    '4.5. Інформація про всі здійснені Користувачем Бронювання, дата, час, місце, обраний Заклад'
    'Виконавця та сума сплаченого Депозиту, доступні Користувачу цілодобово у його Профайлі у'
    'мобільному додатку TheTable.'
    '4.6. Всі питання по оплаті Депозиту, можливості скасування Бронювання з Депозитом та'
    'повернення суми сплаченого Депозиту, Користувач може задати Агенту на електронну пошту info@'
    'thetable.app або за телефоном +380951500402 (тарифікація дзвінків здійснюється згідно умов'
    'мобільного оператора Користувача).'
    '5. СКАСУВАННЯ БРОНЮВАННЯ'
    '5.1. Користувач має право в будь-який час відмовитися від замовлення Послуг з'
    'обслуговування і скасувати Бронювання на умовах, передбачених даним Договором і умовами'
    'Бронювання (далі - «скасування Бронювання»). Скасування Бронювання відбувається через'
    'Мобільний додаток через особистий Профайл або шляхом повідомлення Виконавцю про скасування'
    'Бронювання Адміністратору Закладу Виконавця. Для скасування Бронювання Користувач повинен'
    'повідомити номер здійсненого ним Бронювання або інші ідентифікаційні дані Бронювання, яке'
    'скасовується Користувачем. При скасуванні Бронювання Користувачем, таке Бронювання не'
    'відновлюється і не поновлюється. Користувач втрачає права по скасованому Бронюванню. Користувач'
    'може забронювати Столик повторно. Нове Бронювання не залежить від попереднього, скасованого'
    'Користувачем.'
    '5.2. У разі своєчасного скасування Бронювання Виконавець повертає суму Депозиту, сплачену'
    'Користувачем. Умови та способи повернення коштів вказані в даному Договорі. Своєчасним'
    'вважається скасування Бронювання, здійснене Користувачем не пізніше ніж за чотири години до'
    'часу, на який було заплановано Бронювання. Термін для своєчасного скасування Бронювання'
    'вказується в умовах Бронювання конкретного столика Виконавця та відображається в Профайлі'
    'Користувача.'
    '5.3. Несвоєчасною відмовою від Бронювання (несвоєчасним скасуванням Бронювання) за'
    'даним Договором вважається:'
    '5.3.1. Бронювання, що не використане Користувачем (Користувач або запрошені ним Відвідувачі не'
    'з’явилися в Заклад Виконавця у встановлений дату та час);'
    '5.3.2. запізнення Користувача більш ніж на допустимий час запізнення. Допустимий час запізнення'
    'визначається п. 5.5. даного Договору.'
    '5.3.3. скасування Бронювання, вчинене за межами строку, встановленого для своєчасної відмови'
    ' Бронювання згідно п. 5.2. даного Договору.'
    '5.4. У разі несвоєчасної відмови від Бронювання сума Депозиту, сплачена Користувачем при'
    'Бронюванні, Користувачу не повертається і вважається штрафом за несвоєчасну відмову від'
    'Бронювання (несвоєчасне скасування Бронювання). Послуги з обслуговування при несвоєчасній'
    'відмові від Бронювання не надаються.'
    '5.5. Виконавець має право відмінити (скасувати) Бронювання у випадку, якщо ні Користувач,'
    'ні хоча б одна особа, яка має право прибути в Заклад Виконавця із Користувачем або за його'
    'Бронюванням не з\'явилися після закінчення 30 хвилин, починаючи з часу, на який було заброньовано'
    'Столик, не погодивши заздалегідь із адміністратором Закладу Виконавця зміну часу Бронювання.'
    '6. ВІДПОВІДАЛЬНІСТЬ СТОРІН І ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ'
    '6.1. Сторони Договору несуть відповідальність за своїми зобов\'язаннями відповідно до'
    'чинного законодавства України, в тому числі ЗУ «Про захист прав споживачів».'
    '6.2. Сторони звільняються від відповідальності за часткове або повне невиконання зобов\'язань'
    'за Договором, якщо це невиконання стало наслідком обставин непереборної сили, що виникли після'
    'укладення Договору в результаті подій надзвичайного характеру, які роблять неможливим виконання'
    'зобов\'язань, встановлених Договором, які Сторона не могла ні передбачити, ні запобігти розумними'
    'заходами (форс-мажор).'
    '6.3. Користувач зобов\'язаний повністю відшкодувати Виконавцю понесені збитки, якщо'
    'Користувач заподіяв шкоду майну Виконавця. Відшкодування збитків здійснюється згідно'
    'прейскуранту Виконавця.'
    '7. ГАРАНТІЇ'
    '7.1. Виконавець гарантує Користувачу, що має всі необхідні ліцензії та дозволи, що'
    'вимагаються при наданні послуг громадського харчування, і що діяльність Виконавця здійснюється'
    'відповідно до діючих в Україні стандартів і нормативів.'
    '7.2. Користувач гарантує Виконавцю, що укладає Договір добровільно, повністю ознайомився'
    'з умовами даної Оферти і розуміє предмет цього Договору, а також значення і наслідки своїх дій щодо'
    'укладення та виконання даного Договору. Користувач гарантує, що йому виповнилось 18 років, він'
    'володіє повною цивільною правоздатністю та дієздатністю, Користувач є власником або'
    'уповноваженою особою власника банківської карти, з якої здійснюються операції по оплаті'
    'Бронювання з Депозитом, вся інформація вказана Користувачем у Профайлі Мобільного додатку'
    'TheTable є правдивою, точною, актуальною і повною.'
    '7.3. Користувачу гарантується конфіденційність збереженої у Мобільному додатку інформації'
    'про платежі Користувача.'
    '8. КОНФІДЕНЦІЙНІСТЬ ТА ЗГОДА НА ОБРОБКУ ПЕРСОНАЛЬНИХ ДАНИХ'
    '8.1. Сторони зберігають конфіденційність відомостей, що стали їм відомі у зв\'язку з'
    'виконанням цього Договору, включаючи персональні дані та відомості про розрахунки між'
    'Сторонами.'
    'Сторони взаємно зобов\'язуються сумлінно використовувати і не розголошувати конфіденційну'
    'інформацію, яка стала їм відома у зв\'язку з виконанням Договору, а також отриману ними будь-яким'
    'іншим способом, окрім випадків, коли Сторона зобов\'язана відповідно до законодавства розкрити'
    'конфіденційну інформацію на вимогу компетентних державних органів та / або розкрити таку'
    'інформацію адвокатам, аудиторам, консультантам (за умови розкриття тільки тієї частини інформації,'
    'яка обґрунтовано необхідна в конкретному випадку і при умові дотримання такими особами'
    'зобов\'язання щодо збереження отриманої інформації в таємниці).'
    '8.2. У разі несумлінного використання або розголошення конфіденційної інформації потерпіла'
    'Сторона має право вимагати відшкодування збитків, завданих їй таким недобросовісним'
    'використанням або розголошенням конфіденційної інформації.'
    '8.3. З урахуванням вимог законодавства про захист персональних даних, під час реєстрації у'
    'Мобільному додатку та після здійснення Бронювання, Користувач підтверджує, що поінформований'
    'про обробку його персональних даних. Користувач надає згоду Агенту та Виконавцю на обробку'
    'своїх персональних даних (збір, накопичення, обробку, зберігання, використання і поширення)'
    'відповідно до Закону України «Про захист персональних даних»). А також надає згоду на їх передачу'
    'третім особам.'
    '9. ТЕРМІН ДІЇ І РОЗІРВАННЯ ДОГОВОРУ'
    '9.1. Оферта набуває чинності з моменту розміщення її тексту у Мобільному додатку The Table.'
    'Термін дії оферти не визначений і припиняється на наступний день після дати відкликання оферти'
    'Виконавцем та/або Агентом.'
    '9.2. Договір між Користувачем та Виконавцем на умовах даної Оферти діє до моменту'
    'розірвання Договору або до моменту повного виконання Сторонами своїх зобов’язань по даному'
    'Договору.'
    '9.3. Договір може бути розірваний в наступних випадках:'
    '9.3.1. За згодою сторін.'
    '9.3.2. З інших підстав, передбачених офертою або чинним законодавством України.'
    '10. ЗМНІНА ОФЕРТИ і / або ДОГОВОРУ'
    '10.1. Виконавець має право вносити зміни в умови даної Оферти і / або відкликати Оферту в будьякий час на свій розсуд. У разі внесення змін до Оферти такі зміни вступають в силу з моменту'
    'розміщення зміненого тексту Оферти Агентом у Мобільному додатку.'
    '10.2. Зміни в умовах Оферти не тягнуть зміни вже укладеного Договору.'
    '11. ІНШІ УМОВИ'
    '11.1. Договір, його укладання та виконання регулюється чинним законодавством України. Всі'
    'відносини, що не врегульовані даним Договором, регулюються відповідно до чинного законодавства'
    'України.'
    '11.2. Сторони несуть повну відповідальність за правильність повідомлених ними один одному'
    'контактних даних та реквізитів і зобов\'язуються своєчасно повідомляти іншу Сторону про їх зміну, а у'
    'разі неповідомлення несуть ризик настання пов\'язаних з цим несприятливих наслідків.'
    '11.3. У разі якщо одна чи більше положень Оферти (Договору) є з будь-якої причини недійсними,'
    'такими що не мають юридичної сили, така недійсність не впливає на дійсність будь-якого іншого'
    'положення Оферти (Договору), які залишаються в силі.'
    '11.4. Ознайомившись з усіма умовами обраного Бронювання та даним Договором, Користувач'
    'погоджується з тим, що він одержав від Виконавця всю достовірну та повну інформацію, яка може'
    'бути необхідна для прийняття рішення стосовно замовлення ним обраного Бронювання. Всі ризики у'
    'зв’язку зі зміною обставин, з яких Користувач виходив при укладенні Договору, Користувач несе'
    'самостійно. Зміна таких обставин не може бути підставою для зміни умов Договору, та/або їх'
    'невиконання Користувачем.'
    '11.5. Текст даної Оферти розміщується у Мобільному додатку та доступний у Профайлі для'
    'ознайомлення авторизованого Користувача Мобільного додатку.'
    '11.6. Всі інформаційні повідомлення і листи направляються Користувачу в електронному вигляді'
    'через Особистий кабінет та/або на електронну пошту та/або у вигляді СМС-повідомлення на номер'
    'телефону, вказаний при реєстрації Користувача.'
    '11.7. За умовами даної Оферти Користувач надає згоду на отримання від Виконавця інформації, яка'
    'носить рекламно-інформаційний характер, у спосіб відправлення Виконавцем текстових повідомлень,'
    'в тому числі push-повідомлень через Мобільний додаток, на номер мобільного телефону Користувача'
    'та/або іншим шляхом на власний розсуд Виконавця.'
    'Текст даного Договору доступний у Профайлі авторизованого користувача Мобільного додатку'
    'TheTable.'
    'Текст даної оферти опублікований у Мобільному додатку TheTable 5 липня 2020 р.'
    'Агент:'
    'ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ "АЙ ТІ ТЕЙБЛ"'
    'ідентифікаційний код юридичної особи 43578797'
    'зареєстроване за адресою: 03056, м. Київ, вул. Польова, 23Б'
    'електронна адреса: info@ thetable.app'
    'тел. +380951500402 (тарифікація дзвінків здійснюється згідно умов мобільного оператора'
    'Користувача)';

    return Container(
        child: Column(
          children: [
            const SizedBox(
              child: Text('ПРАВИЛА КОРИСТУВАННЯ', textAlign: TextAlign.justify, style: TextStyle(fontSize: 24),),
            ),
            const Padding(padding: EdgeInsets.only(top: 20)),
            Text(text, textAlign: TextAlign.justify, style: const TextStyle(fontSize: 20),),
          ],
        )
    );
  }
}
