[
  {
    "imageUrl": "https://simona-polagina.com/image/catalog/ukrprikrasi/Brasletkoralovijchervonijshirokij,ukra%D1%97nsk%D1%96prikrasikupitivUkra%D1%97n%D1%96_7.jpg",
    "category": "0",
    "date": "31.10.2022",
    "title": "Українські прикраси: коралові намиста та браслети",
    "body": "Підвищення національної самосвідомості українців під час війни з росією спровокувало збільшення цікавості до автентичної культури та традиції України. Жінки та дівчата хочуть висловити свою позицію, виявити повагу до рідної землі через носіння українського одягу та прикрас. Позиція українського інтернет-магазина Simona Polagina – у підтримці та розвитку національних виробників. Для вас, дорогі україночки, ми створили власну колекцію дизайнерських прикрас на українську тематику у сучасному виконанні. Автентичні українські прикраси – розкішні, багатошарові намиста у багатьох викликають захват. Вони є невід’ємним елементом традиційного вбрання. На просторах інтернету можна знайти багато вінтажних прикрас від наших бабусь, а також вироби сучасних майстринь, що підтримують національний тренд. Ми пропонуємо трошки інший підхід: сучасний, екологічний, з повагою до історичних витоків. У чому мінус традиційних українських прикрас:\"Вінтажне намисто не може коштувати дешево. Це наша культурна спадщина, яка заслуговує на місце у музеї. Переробляти їх – не доцільно (хіба з метою реставрації). Ми маємо зберігати та поважати нашу історію.Складно знайти. У пошуках справжнього українського намиста можна натрапити на підробки. Попит породжую пропозицію, і, нажаль, нечесні люди цим користуються.Складність поєднання у гардеробі. Традиційні українські прикраси чудово пасують до автентичного українського вбрання, яке можна вдягти на якусь важливу подію, виступ, традиційне українське весілля. У той же час поєднати їх з буденним сучасним одягом досить складно.Ми створили нову колекцію, що об’єднує ідею української автентичної культури та підходить для сучасної жінки. Ми не претендуємо на звання відтворення традицій в наших виробах. Ми пропонуємо власну інтерпретацію, за допомогою якої хочемо висловити шану нашій чудовій Україні."
  },
  {
    "imageUrl": "https://simona-polagina.com/image/catalog/stati/os%D1%96n2022/gr(3).jpg",
    "category": "0",
    "date": "31.10.2022",
    "title": "Тренди жіночого одягу осінь 2022",
    "body": "Серед атрибутів стилю гранж можна виділити:сорочки в клітинку;смугасті лонгсліви, джемпери, светри;дірки та потертості на джинсах (особливо широких, мам), джинсових куртках, светрах;джинсові куртки.Стиль гранж виражається в максимально розслаблених, невимушених образах, з елементами оверсайз.На відміну від гранжу, стиль панк у жіночому одязі виражається у більш брутальних та екстравагантних елементах. Стиль панк транслює бунт, злам стереотипів. З актуальних речей можна виділити костюми у червоно-чорну клітинку, шкіряні куртки та тренчі, наявність пряжок, ременів, металевої фурнітури в якості декору.Стриманий, елегантний стиль, що бере початок з одягу американських студентів престижних коледжів. З одягу переважають светри темної гами, сорочки, плісовані спідниці, піджаки, брюки класичних силуетів. Інколи стиль препі називають шкільним стилем. Головна вимога до речей – гарна якість та натуральний склад. Більшість речей базові, тож мають бути якісно виконані, не кошлатитися, не витягуватися, щоб транслювати стриману розкіш. Кольорова гама та принти темні, класичні, стримані.Неоднозначний стиль, який, тим не менше, активно завойовує місце на подіумах. Відсилка до стилю спостерігається переважно в аксесуарах, макіяжі, елементах декору (хутро, декор з пір'ям, кислотні кольори, вузькі окуляри, низька посадка, платформа).Одноманітність та скрупульозність давно поза чатом. Осінню 2022 року актуально поєднувати різні стилі, робити незвичайні комбінації.Декілька принтів у образах роблять його більш цікавим, що приковує увагу. Зазвичай це класичні принти: смужка, клітинка, гусяча лапка, що поєднані між собою. Принти можуть бути яскравими, так як колір все ще в тренді.Крім вже класичних стьобаних курток, сорочок, пальт, в моду входять інші речі зі стібками. Це можуть бути спідниці, брюки, сумки, кросівки та черевики."
  },
  {
    "imageUrl": "https://vogue.ua/cache/article_320x475/uploads/article/54b/5ac/c66/coperni_clp_f22_117_6374c665ac54b.jpeg",
    "category": "0",
    "date": "31.10.2022",
    "title": "Чорне лаковане взуття осінь-зима 2022/2023",
    "body": "Тренд на лаковані речі знову повернувся на модні подіуми цього сезону осінь-зима 2022/2023 – від зухвалих костюмів з вінілу Blumarine до маленьких чорних суконь Loewe та пуховиків Versace. Проте ця тенденція торкнулася не лише одягу, а й взуття. Дизайнери почали експериментувати з блискучим матеріалом, пропонуючи ботфорти, ботильйони, чоботи та туфлі з лакованої чорної шкіри, які стануть окрасою будь-якого образу. Ключ до того, як носити лаковану шкіру в повсякденному житті, цього сезону полягає в балансі між блискучими фактурами і теплими матовими речами. Погодьтеся, є щось дуже привабливе в чорних лакованих ботфортах, що виглядають з-під в'язаної сукні, або в блискучих туфлях-човниках у дуеті зі строгим брючним костюмом, які неодмінно додадуть спокійному образу трохи зухвалості. Так, Courrèges і Coperni використали цей матеріал, щоб підігріти інтерес до осінніх образів – перші представили лаковані ботфорти з елегантним трикотажем, а другі поєднали корпоративні блейзери з ефектними ботфортами-панчохами. Цього сезону можете сміливо вибирати взуття з лакованої шкіри. Цей зухвалий тренд залишиться з нами ще на кілька сезонів наперед точно. Придивіться до елегантних чобіт Saint Laurent, що повторюють контур ніг, лакованих ботильонів Emporio Armani на стійких підборах, які можна носити щодня, або до туфлів з відкритою п'ятою Chanel, які бренд пропонує римувати з в'язаними колготками в холодний період."
  },
  {
    "imageUrl": "https://vogue.ua/media/cache/resolve/inline_990x/uploads/article-inline/7c7/e5a/834/1_6377834e5a7c7.jpeg",
    "category": "0",
    "date": "31.10.2022",
    "title": "Спогади про рідне: нова зимова колекція Katimō",
    "body": "Дім — це простір, сповнений спогадами про рідне. Тут ми можемо бути собою справжніми. Тут ми носимо свій найкомфортніший одяг. Цей вимір комфорту відтворюється в новій зимовій колекції українського бренду Katimō. Затишне вбрання полишає свої звичні межі, перетворюючись на вишукані й водночас розслаблені предмети гардероба.  Стьобане пальто-халат і піжамний сет з костюмної тканини додають відчуття захищеності. Це нагадує нам про враження, що отримуєш від споглядання хуртовини з вікна своєї квартири, лишаючись у її теплі, всередині. На протистоянні тепла й холоду ґрунтується і гармонія колірної палітри: приглушені сірий і сутінковий синій змінюються м’яким відтінком кемел і молочними забарвленнями.Зимові образи обіймають багатошаровістю. Трикотажні легінси, кардигани на ґудзиках і костюми доповнені об’ємною хусткою з вовни, альпаки й кашеміру. Сентиментальність утілюється в маніжках кроше ручної роботи, створених у колаборації з молодим українським брендом Bandura. Переосмисленим домашнім взуттям стали м’які капці з овчини, а знаковим елементом колекції — шуба зі штучного хутра. Дім — це стан. Сама згадка про нього стишує серце в найгамірніші часи. Сам погляд на знайомі речі спричиняє момент внутрішньої правди. Спираючись на такі моменти, ми не боїмося гуляти в хуртовину. Дім — це відчуття, неповторне для кожного, особисте, яким хочеться ділитися з найближчими людьми. Цього сезону бренд ділиться ним у колекції Katimō зима 2022/2023. Нова капсула вже доступна на сайті katimoclothes.com, а також у крамниці на вул. Рейтарській 19 А."
  },
  {
    "imageUrl": "https://vogue.ua/cache/article_320x475/uploads/article/449/66c/4a0/1077a184debca370f2cafb23c36a5766_63604a066c449.jpeg",
    "category": "0",
    "date": "31.10.2022",
    "title": "10 найбажаніших речей цього сезону",
    "body": "Світ моди постійно змінюється, і найточніше його трансформації відстежує Lyst Index — періодичний рейтинг міжнародної платформи Lyst, яка ідентифікує найпопулярніші речі в певний період часу.Кожні три місяці Lyst перевіряє та оцінює пошукові дані, щоб визначити найпопулярніші предмети одягу і бренди кожного кварталу. Деякі з лідерів списку цього сезону перевершили будь-які очікування. Наприклад, сріблясті протисонцеві окуляри Balenciaga зі спортивно-футуристичним дизайном поповнили гардероби безлічі людей по всьому світу. А кросівки Adidas Samba стали улюбленою та незмінною парою взуття сучасної it-girl.Які ще речі увійшли до списку 10 найбажаніших цього сезону? Дивіться нижче повний список бестселерів третього кварталу 2022 року згідно з індексом Lyst.10. Окуляри Balenciaga Swift9. Сумка Valentino Garavani8. Лофери Gucci 1953 Horsebit7. Кофта Patagonia Better Sweater6. Пояс Diesel B-1DR5. Кросівки adidas Samba4. Черевики Ugg Taz3. Майка Prada2. Клоги Birkenstock Boston1. Балетки Miu Miu"
  },
  {
    "imageUrl": "https://vogue.ua/media/cache/resolve/inline_990x/uploads/article-inline/581/c57/0bc/elenareva_63750bcc57581.jpeg",
    "category": "1",
    "date": "31.10.2022",
    "title": "Made in Ukraine: наймодніші сукні з довгими рукавами",
    "body": "Коли температура починає стрімко знижуватися, саме час придивитися до суконь з довгими рукавами, щоб з комфортом провести прохолодні місяці. Елегантні й жіночні образи із затишного в’язання, пухнастого мохеру, еластичного джерсі та м’якої шкіри стануть вашими найулюбленішими в осінньо-зимовий період. Vogue.ua зазирнув до колекцій українських дизайнерів і зібрав наймодніші сукні з довгими рукавами, які стануть вам у пригоді вже зараз.Носити сукні в холодні місяці можна й навіть треба. Щоб не змерзнути, вибирайте затишні трикотажні сукні з довгими рукавами J'ammeme та The Coat by Katya Silchenko, доповнюючи образ високими чоботами; комбінуйте короткі сукні Arutinova зі щільними колготками або поєднуйте невагомі образи Tote в пастельних відтінках з водолазками. Ви також можете використати популярний стилістичний прийом — й одягнути сукню поверх штанів, як це пропонують робити Elenareva та Litkovskaya. Крім того, такі образи вподобали багато які знаменитості та streetstyle-зірки.Крім елегантного чорного кольору, який, безперечно, завжди матиме виграшний вигляд, ми пропонуємо ще розглянути делікатні відтінки лавандового, рожевого, блакитного та зеленого. Наприклад, для особливої події пасуватиме шовкова сукня з довгими рукавами Anna October у дівчачому рожевому відтінку, який зараз на піку популярності. Про це свідчать нові колекції дизайнерів, а також нещодавні виходи знаменитостей у сукнях в улюбленому відтінку ляльки Барбі."
  },
  {
    "imageUrl": "https://vogue.ua/cache/article_320x475/uploads/article/10e/7d5/d11/family_portrait_61c5d117d510e.jpeg",
    "category": "1",
    "date": "31.10.2022",
    "title": "Як люди старшого віку задають модні тренди",
    "body": "Незалежно від того, одягаються вони з ніг до голови у Versace, купують нові колекції Valentino чи поєднують свої вінтажні скарби з леопардовим принтом — дедалі частіше у своїй Instagram-стрічці ви можете зустріти стильного вісімдесятирічного чоловіка або літню пані, від зовнішнього вигляду яких перехоплює подих.«Я припускаю, що популярність цієї тенденції обумовлена тим, що дівчата просто хочуть рости і старіти, як ті жінки, які все ще носять макіяж і щодня роблять укладання, просто щоб піти в продовольчий магазин», — розмірковує 28-річний Анджело, засновник Instagram-акаунту Sciura Glam.Акаунт Sciura Glam прославляє елегантний, іноді ексцентричний, але завжди бездоганний стиль, притаманний переважно міланським жінкам старше 50 років. Слово «sciura» означає «леді» на міланському діалекті. Анджело створив акаунт у 2016 році і на сьогодні у нього понад 200 тис. передплатників. Люди надсилають йому світлини щодня, з ранку до ночі, щоб він розмістив їх на сторінці. «Мені надсилають випадкові фото людей з вулиць, іноді бувають фото бабусь або родичів передплатників», — каже він. Проте критерії для публікації знімків у Sciura Glam строгі: «Мені мають подобатися світло, ракурси, леді або пані повинні бути вдягнені у щось стильне, вінтажні сумки точно стануть бонусом при відборі, і ще важлива зачіска — чим пишніше, тим краще!».Захоплення іконами стилю старшого покоління — не нове явище. Фібі Файло зняла Джоан Дідіон для кампанії Céline ще в 2015 році. Алессандро Мікеле запросив Тіппі Гедрен у 2018 році стати обличчям кампейна Gucci — на той час акторці було 88 років. Історія про те, що Айріс Апфель підписала чотирирічний модельний контракт із IMG, коли їй було 97, також не можна не згадати.Проте цьогоріч більше уваги було приділено стилю реальних людей. Минулого місяця скандинаський бренд Samsøe Samsøe представив пару П'єра (художник) та Йетті (артбайєрка) у своїй кампанії сімейних портретів з підписом: «У шлюбі 50 років. Улюблене заняття в неділю: піти на ринок та зайнятися садівництвом». Тим часом, Zara Men запросили співпрацювати 90-річного інфлюєнсера @ The SpanishKing. Саме «простота і невимушений стиль людей похилого віку» змусила Кайла Ківіярві створити @Gramparents, сторінку, присвячену модним дорослим чоловікам. Співпраця акаунта з копенгагенським брендом одягу Another Aspect цього року допомогла збільшити кількість передплатників сторінки на 100 тисяч.«Найбільше в стилі людей похилого віку приваблює простота, яка відображає дух часу, — каже модна психологиня Каролін Меєр. — Зараз в індустрії існує бажання «сповільнитися», відмовитися від колекцій, які виходять кожні кілька тижнів і перейти до більш стійкої моди, — каже вона. — Стиль, який обирають люди старшого покоління, буде більш стійким, бо вони знають, що їм подобається, що їм підходить і чому. Вони з меншою ймовірністю керуватимуться тенденціями і будуть більш упевненими у своєму виборі».«Ми всі боїмося дорослішання і старіння, і більшість, як і раніше, вважає, що зморшки — це страшний сон, але я думаю, що якщо ви старієте з витонченістю, як ці пані на Sciura Glam, нічого боятися», — каже Анджело. "
  },
  {
    "imageUrl": "https://vogue.ua/cache/article_320x475/uploads/article/a2f/47d/63d/kim_kardashian_attends_the_2022_vanity_fair_oscar_party_news_photo_1648466110_637363d47da2f.jpeg",
    "category": "1",
    "date": "31.10.2022",
    "title": "Лазурово-блакитний — головний колір цього сезону",
    "body": "Схоже, що мода прокладає собі шлях крізь яскраві кольори. Нещодавно всі знаменитості вдягали PP Pink і Barbiecore, а ще раніше свіжий зелений колір під назвою \"Bottega Green\" заполонив гардероби модниць. Тепер є бажання глибоко зануритися в привабливість тихоокеанського блакитного блюзу. Можливо, ви пам’ятаєте, як яскраво-блакитний колір з’явився на подіумі Balenciaga осінь-зима 2022/2023, а потім знову його вдягла Кім Кардаш’ян на премію \"Оскар\". Саме такий лазурово-блакитний відтінок нині є модним трендом, та ми передбачаємо, що в найближчі місяці він стане найбажанішим.Кольори справді проникають у нашу свідомість і гардероб, і цього сезону, судячи з безлічі образів знаменитостей і останніх колекцій брендів, блакитний колір є найактуальнішим. Чи не найкраще це засвідчила зірка «Корони» Елізабет Дебікі в образі Christopher John Rogers Resort 2023 тиждень тому. Пошиті волошкові штани з блакитним асиметричним джемпером об’ємного крою — строгий та вишуканий образ. Дебікі — не єдина знаменитість, яка вибирає лазурово-блакитний колір. Так, Аня Тейлор-Джой зробила ставку на синю шкіряну сукню без бретельок Alexander McQueen весна-літо 2023, щоб завітати на лондонську прем’єру фільму \"Меню\". Водночас цього року такі зірки, як Трейсі Елліс-Росс, інфлюенсерка Грес Ганем, Меган Маркл і модель Олівія Кулпо — усі приміряли одяг у блакитному кольорі. Ця тенденція також проявилася на модних подіумах — від Marni до Dion Lee.Секрет того, як носити будь-який відтінок яскраво-синього й не почуватися схожим на Смурфа, полягає в тому, щоб одягати його з ніг до голови, як Дебікі, поєднуючи водночас різні фактури й відтінки, або комбінувати з нейтральними чи монохромними речами й аксесуарами для пом’якшення яскравості. Синій колір часто асоціюється з відчуттям свободи та спокою, саме тим, чого нині прагне кожен українець. Пропонуємо починати додавати до власного гардероба відтінки синього — підвищення настрою вам забезпечено."
  },
  {
    "imageUrl": "https://vogue.ua/cache/article_320x475/uploads/article/13f/84a/45f/310785293_1774041396298285_3168715173760353367_n_637245f84a13f.jpeg",
    "category": "1",
    "date": "31.10.2022",
    "title": "Пальто із шарфом — теплий вибір на щодень",
    "body": "Кожен осінньо-зимовий сезон має власний тренд на пальто. Головна модель цього року — 2 в 1. Різноманітні вовняні й кашемірові варіанти гарантують бездоганний комфорт і потрібну кількість шику. Створене в стилі мінімалізму, пальто з інтегрованим шарфом, що сприяє грі об’ємів, дає змогу створити особливий теплий образ.Зверніть особливу увагу на коротку модель із чітко вишитими вилогами від Totême, яку можна ефектно стилізувати з улюбленими джинсами й кардиганом. Для тих, хто віддає перевагу дещо класичному стилю, ідеальним варіантом стане пальто Marcela London, доступне в широкій нейтральній палітрі кольорів."
  },
  {
    "imageUrl": "https://vogue.ua/i/image_720x/media/image/638/49f/e54/63849fe54d4ab.jpg",
    "category": "2",
    "date": "31.10.2022",
    "title": "Утеплюємося красиво: показує Дженніфер Лопес",
    "body": "Минулими вихідними, під час сімейного вікенду з нагоди Дня подяки, Дженніфер Лопес продемонструвала дуже затишний і водночас практичний образ, основою якого стала об’ємна шуба з овчини американського бренду COACH. Уважні шанувальники згадали, що торік зірка вже вдягала цю річ, але не з улюбленими джинсами й теплою в’язаною шапкою, а з елегантною чорною сукнею та вишуканими босоніжками. Приклад Дженніфер Лопес засвідчує, що вдягатися треба відповідно до погоди, і можна робити це красиво. Ми зібрали ще кілька прикладів, які допоможуть у цьому."
  },
  {
    "imageUrl": "https://vogue.ua/i/image_720x/media/image/637/f9d/796/637f9d796f051.jpg",
    "category": "2",
    "date": "31.10.2022",
    "title": "Streetstyle: які пуховики вибирають модниці цього сезону",
    "body": "Зима вже майже на порозі, а це означає, що настав час утеплюватися. Найпопулярнішим та найактуальнішим верхнім одягом цього сезону є пуховики. Практичні, теплі, комфортні та універсальні пухові куртки не лише захистять вас від холодної погоди, а й будуть модним елементом у зимовому образі. Щоб не помилитися з відтінком, кроєм і дизайном пуховика, пропонуємо подивитися, які моделі вибирають streetstyle-інфлюенсери цього сезону.Крім теплих пальт і шуб зі штучного хутра, цієї зими модниці вибирають пуховики. Дівчата носять об’ємні моделі з високими комірами, подовжені варіанти нижче від колін, стьобані моделі, пуховики у формі бомберів, шкіряні варіанти, а також куртки до талії, які можна вдягати з високим штанами або джинсами, щоб візуально подовжити силует. Крім базових молочних відтінків, чорних і сірих кольорів, streetstyle-зірки роблять ставку на життєрадісні кольори: жовтий, червоний, рожевий, синій та зелений. На вулицях модних столиць можна помітити поєднання пуховиків з короткими спідницями, елегантними сукнями, утилітарним денімом, шкіряними штанами й діловими костюмами."
  },
  {
    "imageUrl": "https://vogue.ua/i/image_720x1080/rc/kKelwDV2/uploads/image/88c/aa4/98c/1y3a9397_62fb98caa488c.jpeg",
    "category": "5",
    "date": "31.10.2022",
    "title": "Як пройшов благодійний garage sale українських брендів у Fairmont Grand Hotel Kyiv",
    "body": "У суботу, 13 серпня на паркінгу готелю Fairmont Grand Hotel Kyiv відбувся благодійний розпродаж українських модних брендів. Участь в charity garage sale взяли близько 20 представників найактивнішої частини вітчизняної fashion-індустрії – бренди KSENIASCHNAIDER, the Coat by Katya Silchenko, J'AMEMME, Kachorovska, GUDU, Poustovit та багато інших. Захід став логічним продовженням серії благодійних культурно-мистецьких заходів готелю Fairmont Grand Hotel Kyiv, метою яких є збір коштів на потреби українців, що особливо постраждали під час війни. Цього разу усі виручені кошти підуть на підтримку проєкту «Мобільна евакуація поранених» благодійного фонду «КОЛО». Відвідали захід Ірина Данилевська, Катя Сільченко, Тарас Цимбалюк, Олексій Суровцев, Тимур та Інна Мірошниченки, Анастасія Жолинська, Іван Фролов, Lida Lee."
  },
  {
    "imageUrl": "https://vogue.ua/i/image_720x1080/rc/3J8dveGq/uploads/image/762/749/03a/481a5248_62c203a749762.jpeg",
    "category": "5",
    "date": "31.10.2022",
    "title": "We're not limited by geography: команда Vogue UA провела серію зустрічей з європейськими партнерами",
    "body": "Кожен з нас сьогодні бореться на своєму фронті. З першого дня повномасштабного російського вторгнення команда Vogue UA поставила перед собою кілька важливих цілей – висвітлення ситуації в Україні, створення практичного контенту для наших читачок, які опинилися в абсолютно нових для себе життєвих умовах, а також популяризація  української креативної думки у світі. Про це й не тільки ми і розповіли на зустрічах з нашими європейськими партнерами, які відбулися в Мілані й Парижі. Гості заходів змогли познайомитися з нашими досягненнями за останні два роки в емоційному відео, оцінити потенціал видання у світовому масштабі та дізнатися більше про можливості співпраці. "
  },
  {
    "imageUrl": "https://vogue.ua/i/image_720x1080/rc/6QVwpsXx/uploads/image/287/667/7b6/dsc_8865_620f7b6667287.jpeg",
    "category": "5",
    "date": "31.10.2022",
    "title": "EVERY BODY: презентація нового номера Vogue UA",
    "body": "17 лютого в галереї Forsa Art відбулася презентація номера Vogue UA лютий-березень 2022, що ознаменував новий етап у розвитку нашого видання — ми повертаємося до витоків періодики й робимо журнал подібним до альманаху. Every Body — тема цього номера — глобальна для перших випусків нового сезону всіх міжнародних видань Vogue. Ми аналізуємо й оспівуємо тіло різних форм — і в різних формах, від фотографії до белетристики. Під час презентації докладно про головні матеріали випуску розповіли beauty-директорка Олена Пономаренко й fashion-директор Веня Брикалін, а одними з перших побачити колекційне видання прийшли Катя Сільченко, Мар’яна Шевчук, Артем Далакян, Христина Бобкова, Поліна Неня, Лідія Гунько й Артем Климчук. Також гості змогли ознайомитися з інноваційною косметикою Comfort Zone, філософія якої перегукується з головною ідеєю нашого номера — краса буває різною, а любов до себе має залишатися непохитною незалежно від трендів і стандартів. Правильну атмосферу на заході допомогли створити натуральні вина Sabotage Wine, мінеральна вода Perrier і закуски від Best Catering."
  },
  {
    "imageUrl": "https://vogue.ua/i/image_x720/media/image/638/473/e23/638473e230d15.jpg",
    "category": "6",
    "date": "31.10.2022",
    "title": "Справити враження: як Тімоті Шаламе повертає стиль емо на червоний хідник",
    "body": "Тімоті Шаламе завжди знає, як справити враження. Особливо, коли справа стосується вибору вбрання для світських заходів. Хто може забути футуристичні брошки Cartier, які він надів на прем’єру \"Дюни\", чи сріблястий костюм Haider Ackermann на прем’єрі фільму \"Король\"? Однак актор по-особливому продемонстрував креативний підхід до моди саме під час промотуру свого останнього фільму \"Цілком і сповна\", в якому він возз’єднується з режисером \"Називай мене своїм ім’ям\" Лукою Ґуаданьїно для екранізації історії про пару канібалів."
  },
  {
    "imageUrl": "https://vogue.ua/i/image_720x/uploads/article-inline/28f/5e6/127/virgil_abloh_paris_fashion_week_autumn_winter_2019_cropped_6114f14de44d4_612e1275e628f.jpeg",
    "category": "6",
    "date": "31.10.2022",
    "title": "Людина-оркестр: всі таланти Вірджила Абло",
    "body": "28 листопада 2021 року з життя пішов американський дизайнер Вірджил Абло, який був креативним директором чоловічої лінії Louis Vuitton, а також засновником та креативним директором бренду Off-White. На спомин про дизайнера розповідаємо, за що його так любили в моді та сучасній культурі.ХудожникВірджил Абло не мав профільної освіти, та це не завадило йому створити власний бренд Off-White і стати креативним директором Louis Vuitton. Цікаво, але Абло не подобалося, коли його називали модельєром. Вірджил вважав себе художником, адже він радше не створював, а руйнував межі всього дизайнерського. Його головний талант — майже унікальна здатність відчувати та інтерпретувати тренди. Яскравий приклад — пластикові застібки zip-tie (одну з головних візитівок Off-White) він підгледів в інтер’єрі пасажирського літака."
  }
]